#수평으로 두칸 이동 후 수직으로 한칸 이동(오오위, 오오아래, 왼왼위, 왼왼아래)
#수직으로 두칸 이동 후 수평으로 한칸 이동(위위오, 위위좌, 아아오,아아좌)
#이 조건이 체스판의 범위를 벗어나면 continue
graph = [['a1', 'b1', 'c1','d1', 'e1', 'f1', 'g1', 'h1'],
['a2', 'b2', 'c2','d2', 'e2', 'f2', 'g2', 'h2'],
['a3', 'b3', 'c3','d3', 'e3', 'f3', 'g3', 'h3'],
['a4', 'b4', 'c4','d4', 'e4', 'f4', 'g4', 'h4'],
['a5', 'b5', 'c5','d5', 'e5', 'f5', 'g5', 'h5'],
['a6', 'b6', 'c6','d6', 'e6', 'f6', 'g6', 'h6'],
['a7', 'b7', 'c7','d7', 'e7', 'f7', 'g7', 'h7'],
['a8', 'b8', 'c8','d8', 'e8', 'f8', 'g8', 'h8'],]
idx = str(input())
for i in range(8):
    if idx in graph[i]:
        a = graph[i].index(idx)#열
        b = i#행
    else:
        continue
print(a, b)#2,1 =>  1행 2열
cnt = 0
x, y = b, a
dx = [1,1,-1,-1]
dy = [1,-1,1,-1]
for i in range(4):
    nx = x + dx[i]*2
    ny = y + dy[i]
    if 0<=nx<8 and 0<=ny<8:
        cnt += 1
dx = [1,-1,1,-1]
dy = [1,1,-1,-1]
for i in range(4):
    nx = x + dx[i]
    ny = y + dy[i]*2
    if 0<=nx<8 and 0<=ny<8:
        cnt += 1
print(cnt)

#----------------
#아예 방향을 정의하는 방법도 있음
#steps = [(-2,-1), (-1,-2), (1,-2), (2,-1).....]